start_msg_user = """
ПРИВЕТ!🥳

На связи бот🤖
Большой пылесос скидок🔥

Я круглосуточно ищу НАСТОЯЩИЕ скидки на WB специально для тебя!

Примеры товаров, которые я нашёл, можно увидеть на фото выше 🔼🔼🔼
"""

start_msg_user_2 = """Я присылаю скидки📉🔥
на са-а-амые разные товары:

От косметики до автотоваров! 

Посмотрите сами⬆️"""

send_video = """Вот так будет выглядеть Ваша лента подборок⬆️

Попробуйте скорее сами, чтобы убедиться в моей пользе! 🥰❤️‍🔥

Стоимость подписки:
129 руб/месяц

Подписка не продлевается автоматически, так что гарантируем: никаких неожиданных списаний🫡

Для начала работы нажмите ХОЧУ ПОДПИСКУ ниже, либо зайдите в МЕНЮ▶️ОПЛАТИТЬ"""

start_msg_admin = """
Вы находитесь в меню админа
"""

pay_msg = """
Упс! Кажется, Ваша подписка закончилась. 
Пожалуйста, оплатите доступ через кнопку «меню».

Если остались вопросы, пишите @Wberry_admin
"""

pay_confirmation = f"""
<b>Ура! Ваша оплата прошла успешно</b>🥳

Скоро начну скидывать сочные скидки в этот диалог :)

Остались вопросы? Пишите @Wberry_Admin
"""

pay_req = f"""
Для доступа на месяц оплатите 129 рублей по реквизитам ниже⬇️

<code>2200 7010 1252 2204</code>

Т-банк, Антон С.

❗️ОБЯЗАТЕЛЬНО❗️
После оплаты пришлите сюда фотографию чека :)

Мы все проверим и активируем Вашу подписку на мега скидки💞🎁
"""

pay_success = '''Оплата произведена успешно! :)
Скоро бот начнёт присылать товары со скидками.

Чтобы закрыть все возникающие вопросы, мы подготовили для Вас небольшое видео о работе бота. Пожалуйста, посмотрите его👇🏻'''


pay_success_2 = '''⏺ Все скидки будут в этом чате

⏺ Под каждым постом текстом указан размер скидки и актуальная цена

⏺ Чтобы перейти в приложение ВБ, нажмите на название товара

⏺ Вы можете сами убедиться в том, что скидка настоящая, если перейдёте в карточку товара и откроете диапазон цен прямо на ВБ

⏺ ВАЖНО! Иногда продавцы специально завышают начальную стоимость или ВБ не фиксирует цену за какой-то день, поэтому могут встречаться товары по обычной цене

⏺ В нашем боте нет рекламы, все ищет искусственный интеллект. Чтобы находить большую выгоду, просматривайте все посты бота :)

Остались вопросы? Пишите @Wberry_admin

Удачных покупок! 🛍'''


# ***************
start_msg_admin = """
Приветствую тебя Хозяин!
"""


succ_pay_txt = "Оплата произведена успешно! Скоро бот начнёт скидывать товары со скидками :)"

save_id_msg = 'Ваш аккаунт добавлен в рассылку, у Вас бесплатный период 7 дней. Ожидайте сообщений про товары со скидками!'

info_msg = '''
Как работает наш бот? /n

Программа автоматически отслеживает товары, на которые резко снизилась цена./n

Бывает такое, что на товар изначально стояла завышенная цена. Мы не можем отслеживать это вручную, поэтому бот кидает и такие посты в том числе. /n

Чтобы находить самые выгодные предложения, просматривайте все сообщения бота, выгода от покупки в разных товарах будет больше или меньше, это зависит не от нас./n

Приятного пользования!'''

upd_key_words = """Загрузите файл txt в формате \nтрусы+женские 50 \nсмартфоны 60 \nноски 30"""

mailing = """Введите форматированное html-сообщение для рассылки всем пользователям."""

